from flask import Flask, request, jsonify, render_template

app = Flask(__name__)

# Devanagari to Morse Code Mapping
MORSE_CODE_DICT = {
# Vowels (स्वर)
"अ": ".-", "आ": ".-", "इ": "..", "ई": "..",
"उ": "..-", "ऊ": "..-", "ऋ": ".-.-", "ए": ".",
"ऐ": ".-..", "ओ": "---", "औ": "---..",

# Matras (मात्रा)
"ा": ".-", "ि": "..", "ी": "..", "ु": "..-",
"ू": "..-", "ृ": ".-.-", "े": ".", "ै": ".-..",
"ो": "---", "ौ": "---..",

# Consonants (व्यंजन)
"क": "-.-", "ख": "-.-..", "ग": "--.", "घ": "--.-",
"ङ": "--.--", "च": "-.-.", "छ": "-.-.-", "ज": ".---",
"झ": ".---.", "ञ": ".--..", "ट": "-..-", "ठ": "-..--",
"ड": "-..", "ढ": "-..-.", "ण": "--.-", "त": ".-.",
"थ": ".-.-", "द": "..-.", "ध": "..-..", "न": "-.",
"प": ".--.", "फ": ".--.-", "ब": "-...", "भ": "-...-",
"म": "--", "य": "-.--", "र": ".-.", "ल": ".-..",
"व": ".--", "श": "...-", "ष": "...-.", "स": "...",
"ह": "....",

# Half-Letters (अर्धाक्षर)
"क्": "-.-", "ख्": "-.-..", "ग्": "--.", "घ्": "--.-",
"ङ्": "--.--", "च्": "-.-.", "छ्": "-.-.-", "ज्": ".---",
"झ्": ".---.", "ञ्": ".--..", "ट्": "-..-", "ठ्": "-..--",
"ड्": "-..", "ढ्": "-..-.", "ण्": "--.-", "त्": ".-.",
"थ्": ".-.-", "द्": "..-.", "ध्": "..-..", "न्": "-.",
"प्": ".--.", "फ्": ".--.-", "ब्": "-...", "भ्": "-...-",
"म्": "--", "य्": "-.--", "र्": ".-.", "ल्": ".-..",
"व्": ".--", "श्": "...-", "ष्": "...-.", "स्": "...",
"ह्": "....",

# Special Characters
"क्ष": "-.-...", "त्र": "-.--.", "ज्ञ": ".--.-.",

# Numbers (अंक)
"o": "-----", "१": ".----", "२": "..---",
"३": "...--", "४": "....-", "५": ".....",
"६": "-....", "७": "--...", "८": "---..",
"९": "----.",
' ' : "/",
',' : '--..--',
'?' : '..--..',
'.' : '.-.-.-',
'|' : '|',
}

@app.route('/')
def index():
    return render_template('index.html')

@app.route('/convert', methods=['POST'])
def convert():
    data = request.get_json()
    text = data.get('text', '').upper()
    morse_code = ''
    
    for char in text:
        if char in MORSE_CODE_DICT:
            morse_code += MORSE_CODE_DICT[char] + ' '
    
    return jsonify({'morse_code': morse_code.strip()})

if __name__ == '__main__':
    app.run(debug=True)

